package day08;

/*
* 面向对象的三条主线
* 1. java类及类的成员：属性、方法、构造器；代码块、内部类
*
* 2. 面向对象的三大特征： 封装性、继承性、多态性、（抽象性）
*
* 3. 其他关键字：this、super、static、final、abstract、interface、package、import
*
* 面向对象：强调具备功能的对象，以类和对象作为最小单位，考虑谁来做
*	人 {
* 	打开（冰箱） {
* 		冰箱.开（）
* 	}
* 	抬起（大象） {
* 		大象.进入（冰箱）
* 	}
* 	关闭（冰箱） {
* 		冰箱.关（）
* 	}
* }
*
*
* 冰箱 {
* 	开（）{}
* 	关（）{}
* }
*
* 大象 {
* 	进入（冰箱）{}
* }
*
*	面向对象的两个要素： 类 、 对象
* 类： 对一类书屋的描述
* 对象： 是实际存在的该类事务的每个个体
*
* 设计类就是设计类的成员
*
* */

public class OOPTest {
	public static void main(String[] args) {

	}
}
